# Specify directory to install
cask_args appdir: "/Applications"

# Taps
tap 'homebrew/bundle'
tap "buo/cask-upgrade"
tap 'oven-sh/bun'

# Binaries
brew 'bat'
brew 'bun'
brew 'eza'
brew 'doppler'
brew 'fd'
brew 'ffmpeg'
brew 'fnm'
brew 'fzf'
brew 'gh'
brew 'git-delta'
brew 'git-lfs'
brew 'git'
brew 'imagemagick'
brew 'lazygit'
brew 'libpq'
brew 'mas'
brew 'neovim'
brew 'pnpm'
brew 's3cmd'
brew 'tlrc'
brew 'uv'
brew 'zoxide'

cask '1password-cli'
cask '1password'
cask 'alt-tab'
cask 'beeper'
cask 'bruno'
cask 'discord'
cask 'docker-desktop'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'iina'
cask 'iterm2'
cask 'keka'
cask 'keycastr'
cask 'markedit'
cask 'notion'
cask 'pitch'
cask 'pronotes'
cask 'raycast'
cask 'tableplus'
cask 'telegram'
cask 'upscayl'
cask 'visual-studio-code'
cask 'zed'

# Quicklook
cask 'qlmarkdown'
cask 'qlvideo'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-hack-nerd-font'
