# Specify directory to install
cask_args appdir: "/Applications"

# Taps
tap 'homebrew/bundle'
tap "buo/cask-upgrade"
tap 'oven-sh/bun'

# Binaries
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'mas'
brew 'n'
brew 'neovim'
brew 'bat'
brew 'bun'
brew 'poetry'
brew 's3cmd'
brew 'tlrc'
brew 'uv'
brew 'zoxide'

cask '1password-cli'
cask '1password'
cask 'cursor'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'bruno'
cask 'imageoptim'
cask 'loom'
cask 'tableplus'
cask 'telegram-desktop'
cask 'tinkerwell'
cask 'visual-studio-code'
cask 'raycast'
cask 'chatgpt'
cask 'iina'
cask 'iterm2'
cask 'keka'
cask 'markedit'
cask 'notion'
cask 'telegram'
cask 'linear-linear'
cask 'logi-options+'
cask 'pitch'
cask 'arc'


# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-hack-nerd-font'
